[
    "Yo momma is so old, her social security number is 1.",
    "Yo momma is so old, the theme to her prom was fire.",
    "Yo momma is so fat, when she sat on a rainbow, Skittles popped out.",
    "Yo momma is so stupid, she thought a quarterback was a refund.",
    "Yo momma is so ugly, her portraits hang themselves.",
    "Yo momma is so poor, she chases the garbage truck with a grocery list.",
    "Yo momma is so old, she walked out of a museum and the alarm went off.",
    "Yo momma is so fat, when she wears a yellow raincoat, people yell 'Taxi!'",
    "Yo momma is so stupid, she brought a spoon to the Super Bowl.",
    "Yo momma is so ugly, when she tried to join an ugly contest, they said 'Sorry, no professionals.'",
    "Yo momma is so lazy, she stuck her nose out the window and let the wind blow it.",
    "Yo momma is so poor, she can't even afford to pay attention.",
    "Yo momma is so short, you can see her feet on her driver’s license.",
    "Yo momma is so hairy, Bigfoot took a picture of her.",
    "Yo momma is so fat, when she fell I didn't laugh, but the sidewalk cracked up.",
    "Yo momma is so old, she sat next to Moses in third grade.",
    "Yo momma was so ugly, even her reflection said, 'I quit.'",
    "Yo momma has so much hair, when she braids it, it turns into a rope bridge.",
    "Yo momma went to a haunted house and came out with a job application.",
    "Yo momma was so fat, when she went to the beach, the tide came in.",
    "Yo momma has so many chins, she looks like a stack of pancakes.",
    "Yo momma was so lazy, she sat on a couch and it became her permanent address.",
    "Yo momma has so many wrinkles, she uses a GPS to find her way out of them.",
    "Yo momma went to the dentist and they had to use a jackhammer for the plaque.",
    "Yo momma was so old, her birth certificate is in Roman numerals.",
    "Yo momma has such bad breath, people look forward to her farts.",
    "Yo momma went to the zoo, and the animals put up a 'No Humans' sign.",
    "Yo momma was so stupid, she tripped over a wireless connection.",
    "Yo momma has so little money, she can't even afford to pay attention.",
    "Yo momma went to a vegan restaurant and ordered a steak.",
    "Yo momma was so tall, she tripped over a rainbow and fell in the clouds.",
    "Yo momma has such poor eyesight, she thought she saw an angel, but it was just her reflection."
]
